Revit 2027 API
ViewSheetSet.IsAutomatic Property
 Automatic order or manual order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool IsAutomatic { get; set; }
Public Overridable Property IsAutomatic As Boolean
	Get
	Set
public:
virtual property bool IsAutomatic {
	bool get ();
	void set (bool value);
}
abstract IsAutomatic : bool with get, set
override IsAutomatic : bool with get, set
Property Value
Boolean
Implements
IViewSheetSet.IsAutomatic
See Also
Reference
ViewSheetSet Class
Autodesk.Revit.DB Namespace